Revit 2027 API
VertexBuffer.GetVertexStreamPosition Method
 Gets a stream that can be used to write vertices of type VertexPosition into the buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexStreamPosition GetVertexStreamPosition()
Public Function GetVertexStreamPosition As VertexStreamPosition
public:
VertexStreamPosition^ GetVertexStreamPosition()
member GetVertexStreamPosition : unit -> VertexStreamPosition
Return Value
VertexStreamPosition
 The stream that can be used to write into this buffer.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown if the buffer is not mapped. -or- Thrown if the buffer has insufficient space.
See Also
Reference
VertexBuffer Class
Autodesk.Revit.DB.DirectContext3D Namespace